app/views/pedidos/_form.html.erb

    <%= f.label :cliente_id, :class => 'control-label' %>
    <%= f.collection_select :cliente_id, Cliente.all, :id, :nome, :prompt => "Selecione", :class => 'text_field' %>
---
SELECT "clientes".* FROM "clientes"