app/views/pedidos/_form.html.erb

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT 1  [["id", "2"]]
---
  <% elsif (current_usuario.admin? || current_usuario.gerente?) && params[:action] == "edit" %>
    <h4> Cliente: <%= Pedido.find_by_id(params[:id].to_i).cliente.nome %> </h4>