app/views/pedidos/_form.html.erb

SELECT "produtos".* FROM "produtos"
---
    <%= f.fields_for :item_de_pedidos do |item| %>
      <%= item.collection_select :produto_id, Produto.all, :id, :nome, :default => "Selecione", :class => 'text_field' %>