app/controllers/clientes_controller.rb

  def index
    if current_usuario.admin?
      @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def create
    @cliente = Cliente.new(cliente_params)
    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("celular", "complemento", "created_at", "data_de_nascimento", "empresa", "endereco", "nome", "ramal", "sexo", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)