app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos"
---
  def index
    @pedidos = Pedido.all

SELECT "clientes".* FROM "clientes" WHERE "clientes"."usuario_id" = ? LIMIT 1  [["usuario_id", 1]]
INSERT INTO "pedidos" ("cliente_id", "created_at", "descricao", "forma_de_pagamento", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cliente_id", 1], ["created_at", Wed, 09 Apr 2014 00:59:16 UTC +00:00], ["descricao", "aaa"], ["forma_de_pagamento", ""], ["updated_at", Wed, 09 Apr 2014 00:59:16 UTC +00:00]]
---
  def create
    @pedido = Pedido.new(pedido_params)
    debugger
    @pedido.cliente = Cliente.find(current_usuario.cliente.id)
    descricao = "Arroz "+ params[:arroz]
      if params[:feijao] = "Sim"
        descricao = descricao + ", Feijao, "
      end

      if params[:farofa] == "Sim"
        descricao = descricao + ", Farofa,"
      end

    descricao = descricao + params[:carne] + ", " + params[:acompanhamento] + " Salada: "+ params[:salada]

    @pedido.descricao = descricao
    respond_to do |format|
      if @pedido.save

SELECT "item_de_pedidos".* FROM "item_de_pedidos" WHERE "item_de_pedidos"."pedido_id" = ? ORDER BY "item_de_pedidos"."id" DESC LIMIT 1  [["pedido_id", 2]]
SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "item_de_pedidos" WHERE "item_de_pedidos"."id" = ?  [["id", 1]]
---
  def update
    #debugger
    parametros = pedido_params
    itens = params[:pedido][:item_de_pedidos_attributes]
    if !itens.nil?
      for i in 0..params[:pedido][:item_de_pedidos_attributes].count do
        if itens["#{i}"] != nil
          if itens["#{i}"][:_destroy] == "1"
            codigo_item = itens["#{i}"][:id]
            item = ItemDePedido.find(codigo_item.to_i)
            item.destroy

UPDATE "pedidos" SET "descricao" = ?, "updated_at" = ? WHERE "pedidos"."id" = 4  [["descricao", "Arroz Branco, Feijao, , Farofa,Carne Seca com Abobora, Capeletti Salada: Alface e Tomate"], ["updated_at", Wed, 16 Apr 2014 18:37:10 UTC +00:00]]
---
    @pedido.descricao = descricao

    respond_to do |format|
      if @pedido.update(parametros)

DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 1]]
---
  def destroy
    @pedido.destroy

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_pedido
      @pedido = Pedido.find(params[:id])