app/controllers/pedidos_controller.rb

SELECT "pedidos".* FROM "pedidos" ORDER BY "pedidos"."id" DESC LIMIT 1
---
  def update
    # valor = params[:pedido][:valor]
    # params[:pedido][:valor] = valor.split( ',').join('.')

#    descricao = ""
    @pedido.cliente = Cliente.find_by_id(params[:cliente_id].to_i)

    pa = @pedido.pedidos_acompanhamentos
    acompanhamento_editado = []
    acompanhamento_novo = []
    acompanhamentos = Acompanhamento.where(:disponibilidade => true).count
    for i in 0...acompanhamentos do
      acompanhamento=nil
      if  !params["acompanhamento_#{i}"].blank?
        acompanhamento = Acompanhamento.find(params["acompanhamento_#{i}"])
      end
      if @pedido.acompanhamentos.include? acompanhamento