app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.paginate(:page => params[:page], :per_page => 2)
---
SELECT "produtos".* FROM "produtos"

  def create
    valor = params[:produto][:valor_unitario]
    params[:produto][:valor_unitario] = valor.split( ',').join('.')

    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("created_at", "nome", "updated_at", "valor_unitario") VALUES (?, ?, ?, ?)  [["created_at", Wed, 09 Apr 2014 00:07:35 UTC +00:00], ["nome", "Coca Cola Lata"], ["updated_at", Wed, 09 Apr 2014 00:07:35 UTC +00:00], ["valor_unitario", 3.0]]

  def update
    valor = params[:produto][:valor_unitario]
    params[:produto][:valor_unitario] = valor.split( ',').join('.')

    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "valor_unitario" = ?, "updated_at" = ? WHERE "produtos"."id" = 5  [["valor_unitario", 1.5], ["updated_at", Sun, 27 Apr 2014 17:05:24 UTC +00:00]]